const nastan = [
    {
        "id": 0,
        "title": "Настан 1",
        "objavenona": "5/5/2020",
        
        
        
        "descr": "Едноставен метод за групна приоритизација или донесување одлуки. Ова не е активност сама по себе, туку метод што треба да се користи во процесите каде што се јавува приоритет или одлучувањето е цел. Со овој групен методот за брзо се гледа кои опции се најпопуларни или релевантни. Опциите или идеите се напишани на стикери или залепени на ѕид за цела група да ги види. Секое лице гласа за можностите за кои смета дека се најиздржани, а таа информација се користи за да се донесе одлука"
     },
    {
        "id": 1,
        "title": "Настан 2",
        "objavenona": "5/5/2020",
        
        
        
        "descr": "Овој метод е корисен за оценување на проект во тек, за да се види дали треба да сенаправат корекции за тимот да работи поефективно заедно. Обезбедува рамка задискусија. Учесниците се фокусираат на работите што помагаат или го попречуваат тимскиот процес и создаваат чекори за подобрување."
     },
    {
        "id": 2,
        "title": "Настан 3",
        "objavenona": "5/5/2020",
        
        
       
        "descr": "\nОвој едноставен и моќен метод е корисен за откривање на јадрото на проблемот или предизвикот. Како што сугерира насловот, групата дефинира проблеми, а потоа го поставува прашањето 'зошто' пет пати, често користејќи го даденото објаснување како почетна точка за креативно решавање на проблеми."
     },
    {
        "id": 3,
        "title": "Настан 4",
        "objavenona": "5/5/2020",
        
        
        "material": "\nПенкала/маркери, Флипчарт",
        "descr": "\nОваа алатка им помага на малите и големите групи да ги идентификуваат клучните трансформативни трендови во текот на следните три години, да ги истражат нивните последици и да почнат да гледаат како можат да се исполнат за да создадат можности за бизнис. До крајот на работилницата, учесниците креираат листа на најрелевантни трендови; и разработка на три најважни трендови, вклучувајќи идеи околу тоа како нивната организација би можела да дејствува за да ги исполни."
     },
    {
        "id": 4,
        "title": "Настан 5",
        "objavenona": "5/5/2020",
        
        

        "descr": "Кратка вежба за да се донесе 'градењето приказна' во живот: клучен концепт во мрежните дигитални комуникации."
     },
    {
        "id": 5,
        "title": "Настан 6",
        "objavenona": "5/5/2020",
        
        
        "descr": "Ова е практичен, динамичен и разноврсен метод за групи, да истражуваат идеи и прашања заедно. Нешто како физички прашалник; учесниците одговараат на прашања со одење околу просторот и ставајќи се на замислена линија. Ова обезбедува почетна точка за размислување и дискусија, и го зајакнува тимскиот дух."
    },
    {
        "id": 6,
        "title": "Настан 7",
        "objavenona": "5/5/2020",
        
        
        "descr": "\nIDOARRT е едноставна алатка која ќе ви помогне да водите ефикасен состанок или групен процес со поставување јасна цел, структура и цели на самиот почеток. Таа има за цел да им овозможи на сите учесници да го разберат секој аспект од состанокот или процесот, со што се создава сигурност со заедничка основа, како за почеток. Акронимот се залага за намера, посакуван исход, агенда, правила, улоги и одговорности и време."
     },
    {
        "id": 7,
        "title": "Настан 8",
        "objavenona": "5/5/2020",
        
        
        "descr": "Ова е мала стратешка сесија за планирање која им помага на групи и поединци да преземат акција кон посакуваните промени. Често се користи на крајот од работилницата или програмата. Групата дискутира и се согласува со визија, а потоа создава некои чекори за дејствување кои ќе ги водат кон таа визија. Обемот на предизвикот исто така е дефиниран, преку дискусија за корисни и штетни фактори кои влијаат врз групата."
     },
    {
        "id": 8,
        "title": "Настан 9",
        "objavenona": "5/5/2020",
        
        
        "descr": "Целта на оваа вежба е да ги поддржи учесниците во примена на нивните согледувања и учења, со пишување на писмо и испраќање до нивната идна личност. Тие можат да ги дефинираат клучните дејствија кои би сакале да ги преземат во иднина и да ги изразат своите причини зошто е потребно да се случи таа промена."
      },
    {
        "id": 9,
        "title": "Настан 10",
        "objavenona": "5/5/2020",
        
        
        "descr": "Оваа активност ги поддржува учесниците да размислуваат за едно прашање и дa генерираат сопствени решенија користејќи едноставни принципи на активно слушање.Oва е одличен вовед во активното слушање, но исто така може да се користи со групи кои веќе се запознаени со него. Учесниците работат во групи од три и се претвораат во 'субјект', слушател и набљудувач."
    },
    {
        "id": 10,
        "title": "Настан 11",
        "objavenona": "5/5/2020",
        
        
        "descr": "Редовен и ефективен фидбек е еден од најважните состојки во градењето конструктивни односи и просперитетни тимови. Отвореноста создава доверба и довербата создава поголема отвореност. Вежбите за фидбек имаат за цел да ги поддржат групите за да се изгради доверба и отвореност и за поединците да стекнат самосвест и увид. Вежбите за фидбек треба секогаш да се изведуваат со внимателност и висока свесност за групната динамика. Ова е добра рана повратна вежба кога членовите на групата веќе имаат развиено некоја удобност и сè уште се запознаваат меѓусебно. Се фокусира на споделување на благодарност и љубопитност едни за други."
    },
    {
        "id": 11,
        "title": "Настан 12",
        "objavenona": "5/5/2020",
        
        
        "descr": "Вежба за учесниците да истражат кои се нивните најважни вредности. Тоа е направено на интуитивен и брз начин за да ги поттикне учесниците да го следат интуитивното чувство, наместо да размислуваат и да ги најдат 'точните' вредности. Ова е добра вежба за користење за да се иницира размислување и дијалог околу личните вредности."
     },
    {
        "id": 12,
        "title": "Настан 13",
        "objavenona": "5/5/2020",
        
        
        "descr": "Цел:\n Индивидуалната рефлексија помага да ги одвоиме комплексните искуства, така што успесите на искуството може да се повторат или подобрат, а неуспесите обезбедуваат можности за учење и раст. Форматот е флексибилен, ве води низ клучните фази на процесот на размислување и завршува со клучните точки за акција."
     },
    {
        "id": 13,
        "title": "Настан 13",
        "objavenona": "5/5/2020",
        
        
        "descr": "Вежбите за фидбек имаат за цел да ги поддржат групите за да се изгради доверба и отвореност, за поединците да стекнат самосвест и увид. Вежбите за повратни информации секогаш треба да се водат со внимателности високата свесност за групната динамика."
     },
    {
        "id": 14,
        "title": "Настан 14",
        "objavenona": "5/5/2020",
        
        
        "descr": "Работилница за тим кој ќе размислува за минатите конфликти и ги користи за да генерира насоки за ефикасно ракување со конфликти. Користете ja за да отворите дискусија."
    },
    {
        "id": 15,
        "title": "Настан 15",
        "objavenona": "5/5/2020",
        
        
        "descr": ""
       
    },
    {
        "id": 16,
        "title": "Настан 16",
        "objavenona": "5/5/2020",
        
        
        "descr": "Едноставна вежба во која секој учесник подготвува лична презентација за себе и споделува неколку важни искуства, настани, луѓе или приказни кои придонеле за негово или нејзино како поединец. Целта на личните презентации е да се поддржи секој учесник со цел да се запознаат едни со други и да градат доверба и отвореност во групата."
    },
    {
        "id": 17,
        "title": "Настан 17",
        "objavenona": "5/5/2020",
        
        
        "descr": "Работилница за преглед на тимските приоритети и правење избор на што требa да се фокусирате индивидуално, како и колективно. Работилницата ги предизвикува членовите да размислуваат каде можат да имаат најголемо влијание и импакт. Користете ја оваа работилница за да ги усовршите приоритетите."
        
    }
];
let title1 = document.querySelector(".title1");
let title2 = document.querySelector(".title2");

let desc = document.querySelector(".desc");
let container = document.querySelector("#container");
let objavenona = document.querySelector(".objavenona");
let number = document.location.hash;
let id = number.match(/\d+/g).map(Number);
// console.log(id[0]);
// $('.objavenona').html('<h1><em>Hello</em></h1>')
let selectnastan = nastan[id[0]];
title1.innerHTML += selectnastan.title;
title2.innerHTML += selectnastan.title;

desc.innerText += selectnastan.descr;
objavenona.innerText += selectnastan.objavenona;



